# MassLevelDataId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MassSurfaceData..::..MassLevelDataId Property
MassSurfaceData Class See Also
---
The MassLevelData used when the surface is horizontal, planar, and at the same height as a MassLevelData related to the same mass as the referenced face.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementId MassLevelDataId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MassLevelDataId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ MassLevelDataId {
	ElementId^ get ();
}
```

# See Also
MassSurfaceData Class
Autodesk.Revit.DB.Analysis Namespace